In [177]:
import pandas as pd
import numpy as np

# Excel to Python Lesson 2: Pandas in the Mist

Lesson 1 focused on getting your data loaded into Pandas. 
Now, we'll start manipulating that data into something useful.

This lesson is meant to be introductory level and will act as a survey of things that are possible.
Future lessons will get into the digital weeds.

Lesson Topics:
* Simple Data Cleansing
    * Handling Nulls
    * Handling Duplicates
    * Handling Duplicates
* Table Manipulations
    * Splitting Fields
    * Dropping Columns
    * Aggregations
* Combining Tables
    * Concat/Append - Combining Data
    * Merge - Database Style Joins
* Excel Lyfe
    * VLOOKUP
    * Pivot Tables

In [126]:
# load data to be used

simple1_df = pd.read_csv('simple_data_cleansing_1.csv')
simple2_df = pd.read_csv('simple_data_cleansing_2.csv')

solo_df = pd.read_csv('solo_table.tsv', sep='\t')

concat_a_df = pd.read_csv('concat_table_a.tsv', sep='\t')
concat_b_df = pd.read_csv('concat_table_b.tsv', sep='\t')

concat_c_df = pd.read_csv('concat_table_c.tsv', sep='\t')

## Simple Data Cleansing

### Handling Nulls
`df.dropna() # drops if anything in the row is null`

`df.dropna(how='all') # drops if the entire row is null`

`df.dropna(axis=1, how='all') # drops columns where all data is null`

`df.fillna(0, inplace=True)`
`df.fillna({1: 'X', 2: 0}, inplace=True)`

In [19]:
# Let's look at the data we have
simple1_df

                  name favorite_bird allergic_to_unicorns_flag
0        Santos Halper         raven                         Y
1         Robert McFly         eagle                         N
2         Robert McFly         eagle                         N
3  Person McPersonface           NaN                         Y
4            Lando Kal         finch                         Y
5                  NaN           NaN                       NaN
6                  NaN         raven                         Y
7             Sar Dean       pelican                         Y
8             Sar Dean          dove                         Y

In [20]:
# This will drop any rows that have any nulls
simple1_df.dropna()

            name favorite_bird allergic_to_unicorns_flag
0  Santos Halper         raven                         Y
1   Robert McFly         eagle                         N
2   Robert McFly         eagle                         N
4      Lando Kal         finch                         Y
7       Sar Dean       pelican                         Y
8       Sar Dean          dove                         Y

In [21]:
# Let's remove only the row that had all nulls
simple1_df.dropna(how='all')

                  name favorite_bird allergic_to_unicorns_flag
0        Santos Halper         raven                         Y
1         Robert McFly         eagle                         N
2         Robert McFly         eagle                         N
3  Person McPersonface           NaN                         Y
4            Lando Kal         finch                         Y
6                  NaN         raven                         Y
7             Sar Dean       pelican                         Y
8             Sar Dean          dove                         Y

In [28]:
# what if a column was all nulls?
simple2_df

                  name favorite_bird allergic_to_unicorns_flag  favorite_color
0        Santos Halper         raven                         Y             NaN
1         Robert McFly         eagle                         N             NaN
2         Robert McFly         eagle                         N             NaN
3  Person McPersonface           NaN                         Y             NaN
4            Lando Kal         finch                         Y             NaN
5                  NaN           NaN                       NaN             NaN
6                  NaN         raven                         Y             NaN
7             Sar Dean       pelican                         Y             NaN
8             Sar Dean          dove                         Y             NaN

In [33]:
# Let's remove favorite_color as it's all nulls
new_simple_df = simple2_df.dropna(axis=1, how='all')
new_simple_df

                  name favorite_bird allergic_to_unicorns_flag
0        Santos Halper         raven                         Y
1         Robert McFly         eagle                         N
2         Robert McFly         eagle                         N
3  Person McPersonface           NaN                         Y
4            Lando Kal         finch                         Y
5                  NaN           NaN                       NaN
6                  NaN         raven                         Y
7             Sar Dean       pelican                         Y
8             Sar Dean          dove                         Y

In [37]:
# let's drop that null row
new_simple_df = new_simple_df.dropna(how='all')
new_simple_df

                  name favorite_bird allergic_to_unicorns_flag
0        Santos Halper         raven                         Y
1         Robert McFly         eagle                         N
2         Robert McFly         eagle                         N
3  Person McPersonface           NaN                         Y
4            Lando Kal         finch                         Y
6                  NaN         raven                         Y
7             Sar Dean       pelican                         Y
8             Sar Dean          dove                         Y

In [38]:
# Let's replace the null bird values with wren
new_simple_df.fillna('wren')

                  name favorite_bird allergic_to_unicorns_flag
0        Santos Halper         raven                         Y
1         Robert McFly         eagle                         N
2         Robert McFly         eagle                         N
3  Person McPersonface          wren                         Y
4            Lando Kal         finch                         Y
6                 wren         raven                         Y
7             Sar Dean       pelican                         Y
8             Sar Dean          dove                         Y

In [45]:
# Let's try again by specifying the column to replace
new_simple_df.fillna({'favorite_bird':'wren'}, inplace=True)
new_simple_df

In [46]:
new_simple_df

                  name favorite_bird allergic_to_unicorns_flag
0        Santos Halper         raven                         Y
1         Robert McFly         eagle                         N
2         Robert McFly         eagle                         N
3  Person McPersonface          wren                         Y
4            Lando Kal         finch                         Y
6                  NaN         raven                         Y
7             Sar Dean       pelican                         Y
8             Sar Dean          dove                         Y

In [47]:
# And do the same for the name
new_simple_df.fillna({'name':'Anonymous User'}, inplace=True)
new_simple_df

                  name favorite_bird allergic_to_unicorns_flag
0        Santos Halper         raven                         Y
1         Robert McFly         eagle                         N
2         Robert McFly         eagle                         N
3  Person McPersonface          wren                         Y
4            Lando Kal         finch                         Y
6       Anonymous User         raven                         Y
7             Sar Dean       pelican                         Y
8             Sar Dean          dove                         Y

### Handling Duplicates

`df.drop_duplicates()  # drops the pure duplicates`

`df.drop_duplicates(['col1', 'col2'], keep='last')`

In [48]:
new_simple_df.drop_duplicates()

                  name favorite_bird allergic_to_unicorns_flag
0        Santos Halper         raven                         Y
1         Robert McFly         eagle                         N
3  Person McPersonface          wren                         Y
4            Lando Kal         finch                         Y
6       Anonymous User         raven                         Y
7             Sar Dean       pelican                         Y
8             Sar Dean          dove                         Y

In [51]:
new_simple_df.drop_duplicates(['name'], keep='last')

                  name favorite_bird allergic_to_unicorns_flag
0        Santos Halper         raven                         Y
2         Robert McFly         eagle                         N
3  Person McPersonface          wren                         Y
4            Lando Kal         finch                         Y
6       Anonymous User         raven                         Y
8             Sar Dean          dove                         Y

## Single Table Manipulations

In [95]:
solo_df.head()

   transaction_id quarter     customer_name transit_code  order_total_amt
0            3345      Q1  Robert Robertson           X4              100
1            3346      Q1     David Davison           Y4              230
2            3347      Q1        Jack Froot           X5              332
3            3348      Q1      Dolby Sorand           Y5               50
4            3349      Q1  Robert Robertson           X6               65

#### Splitting Columns

In [101]:
# Let's start by splitting the customer_name field into a first_name and last_name
solo_df[['first_name', 'last_name']] = solo_df['customer_name'].str.split(' ', expand=True)
solo_df.head()

,transaction_id,quarter,customer_name,transit_code,order_total_amt,first_name,last_name
0,3345,Q1,Robert Robertson,X4,100,Robert,Robertson
1,3346,Q1,David Davison,Y4,230,David,Davison
2,3347,Q1,Jack Froot,X5,332,Jack,Froot
3,3348,Q1,Dolby Sorand,Y5,50,Dolby,Sorand
4,3349,Q1,Robert Robertson,X6,65,Robert,Robertson

#### Dropping Columns

In [102]:
# Let's get rid of customer_name and transit_code
solo_df.drop(['customer_name', 'transit_code'], axis=1, inplace=True)
solo_df.head()

   transaction_id quarter  order_total_amt first_name  last_name
0            3345      Q1              100     Robert  Robertson
1            3346      Q1              230      David    Davison
2            3347      Q1              332       Jack      Froot
3            3348      Q1               50      Dolby     Sorand
4            3349      Q1               65     Robert  Robertson

#### Aggregations

##### Order Total Amount by Quarter

If this was SQL, we could do like this:

```
SELECT quarter, SUM(order_total_amt)
FROM solo_df
GROUP BY quarter;
```

In [104]:
solo_df.groupby('quarter').sum()

         transaction_id  order_total_amt
quarter
Q1                70455             4552
Q2                57358             4772
Q3                30483             2125
Q4                27164             1525

In [105]:
solo_df.groupby('quarter').order_total_amt.sum()

quarter
Q1    4552
Q2    4772
Q3    2125
Q4    1525
Name: order_total_amt, dtype: int64

In [106]:
solo_df.groupby('quarter').order_total_amt.agg(min_order='min', max_order='max', avg_order='mean', total_order='sum')

         min_order  max_order   avg_order  total_order
quarter
Q1              50        567  216.761905         4552
Q2              50        567  280.705882         4772
Q3              50        567  236.111111         2125
Q4              50        543  190.625000         1525

In [111]:
solo_df.groupby(['last_name']).order_total_amt.sum()

last_name
Davison      3818
Froot        3621
Robertson    2213
Sorand       3322
Name: order_total_amt, dtype: int64

In [117]:
solo_df['running_total'] = solo_df.order_total_amt.cumsum()
solo_df.head(20)

,transaction_id,quarter,order_total_amt,first_name,last_name,running_total
0,3345,Q1,100,Robert,Robertson,100
1,3346,Q1,230,David,Davison,330
2,3347,Q1,332,Jack,Froot,662
3,3348,Q1,50,Dolby,Sorand,712
4,3349,Q1,65,Robert,Robertson,777
5,3350,Q1,80,David,Davison,857
6,3351,Q1,125,Jack,Froot,982
7,3352,Q1,225,Dolby,Sorand,1207
8,3353,Q1,347,Robert,Robertson,1554
9,3354,Q1,567,David,Davison,2121
10,3355,Q1,334,Jack,Froot,2455
11,3356,Q1,543,Dolby,Sorand,2998
12,3357,Q1,100,Robert,Robertson,3098
13,3358,Q1,230,David,Davison,3328
14,3359,Q1,332,Jack,Froot,3660
15,3360,Q1,50,Dolby,Sorand,3710
16,3361,Q1,65,Robert,Robertson,3775
17,3362,Q1,80,David,Davison,3855
18,3363,Q1,125,Jack,Froot,3980
19,3364,Q1,225,Dolby,Sorand,4205

## Combining Tables

### Concat - Combining Data

#### Add more of the same data to the end of a dataframe

In [120]:
concat_a_df.head()

   transaction_id quarter     customer_name transit_code  order_total_amt
0            3345      Q1  Robert Robertson           X4              100
1            3346      Q1     David Davison           Y4              230
2            3347      Q1        Jack Froot           X5              332
3            3348      Q1      Dolby Sorand           Y5               50
4            3349      Q1  Robert Robertson           X6               65

In [121]:
concat_b_df.head()

   transaction_id quarter     customer_name transit_code  order_total_amt
0            3366      Q2     David Davison          Y14              567
1            3367      Q2        Jack Froot          X15              334
2            3368      Q2      Dolby Sorand          Y15              543
3            3369      Q2  Robert Robertson          X16              100
4            3370      Q2     David Davison          Y16              230

In [124]:
combined = pd.concat([concat_a_df, concat_b_df], ignore_index=True)
combined

    transaction_id quarter     customer_name transit_code  order_total_amt
0             3345      Q1  Robert Robertson           X4              100
1             3346      Q1     David Davison           Y4              230
2             3347      Q1        Jack Froot           X5              332
3             3348      Q1      Dolby Sorand           Y5               50
4             3349      Q1  Robert Robertson           X6               65
5             3350      Q1     David Davison           Y6               80
6             3351      Q1        Jack Froot           X7              125
7             3352      Q1      Dolby Sorand           Y7              225
8             3353      Q1  Robert Robertson           X8              347
9             3354      Q1     David Davison           Y8              567
10            3355      Q1        Jack Froot           X9              334
11            3356      Q1      Dolby Sorand           Y9              543
12            3357      Q1  Robert Robertson          X10              100
13            3358      Q1     David Davison          Y10              230
14            3359      Q1        Jack Froot          X11              332
15            3360      Q1      Dolby Sorand          Y11               50
16            3361      Q1  Robert Robertson          X12               65
17            3362      Q1     David Davison          Y12               80
18            3363      Q1        Jack Froot          X13              125
19            3364      Q1      Dolby Sorand          Y13              225
20            3365      Q1  Robert Robertson          X14              347
21            3366      Q2     David Davison          Y14              567
22            3367      Q2        Jack Froot          X15              334
23            3368      Q2      Dolby Sorand          Y15              543
24            3369      Q2  Robert Robertson          X16              100
25            3370      Q2     David Davison          Y16              230
26            3371      Q2        Jack Froot          X17              332
27            3372      Q2      Dolby Sorand          Y17               50
28            3373      Q2  Robert Robertson          X18               65
29            3374      Q2     David Davison          Y18               80
30            3375      Q2        Jack Froot          X19              125
31            3376      Q2      Dolby Sorand          Y19              225
32            3377      Q2  Robert Robertson          X20              347
33            3378      Q2     David Davison          Y20              567
34            3379      Q2        Jack Froot          X21              334
35            3380      Q2      Dolby Sorand          Y21              543
36            3381      Q2  Robert Robertson          X22              100
37            3382      Q2     David Davison          Y22              230

In [127]:
concat_c_df

    process_flag
0              1
1              1
2              1
3              1
4              1
5              1
6              1
7              2
8              2
9              0
10             0
11             0
12             0
13             0
14             0
15             2
16             2
17             2
18             2
19             2
20             2

In [128]:
# What happens here?
pd.concat([concat_a_df, concat_c_df])

,transaction_id,quarter,customer_name,transit_code,order_total_amt,process_flag
0,3345.0,Q1,Robert Robertson,X4,100.0,NaN
1,3346.0,Q1,David Davison,Y4,230.0,NaN
2,3347.0,Q1,Jack Froot,X5,332.0,NaN
3,3348.0,Q1,Dolby Sorand,Y5,50.0,NaN
4,3349.0,Q1,Robert Robertson,X6,65.0,NaN
5,3350.0,Q1,David Davison,Y6,80.0,NaN
6,3351.0,Q1,Jack Froot,X7,125.0,NaN
7,3352.0,Q1,Dolby Sorand,Y7,225.0,NaN
8,3353.0,Q1,Robert Robertson,X8,347.0,NaN
9,3354.0,Q1,David Davison,Y8,567.0,NaN
10,3355.0,Q1,Jack Froot,X9,334.0,NaN
11,3356.0,Q1,Dolby Sorand,Y9,543.0,NaN
12,3357.0,Q1,Robert Robertson,X10,100.0,NaN
13,3358.0,Q1,David Davison,Y10,230.0,NaN
14,3359.0,Q1,Jack Froot,X11,332.0,NaN
15,3360.0,Q1,Dolby Sorand,Y11,50.0,NaN
16,3361.0,Q1,Robert Robertson,X12,65.0,NaN
17,3362.0,Q1,David Davison,Y12,80.0,NaN
18,3363.0,Q1,Jack Froot,X13,125.0,NaN
19,3364.0,Q1,Dolby Sorand,Y13,225.0,NaN
20,3365.0,Q1,Robert Robertson,X14,347.0,NaN
0,NaN,NaN,NaN,NaN,NaN,1.0
1,NaN,NaN,NaN,NaN,NaN,1.0
2,NaN,NaN,NaN,NaN,NaN,1.0
3,NaN,NaN,NaN,NaN,NaN,1.0
4,NaN,NaN,NaN,NaN,NaN,1.0
5,NaN,NaN,NaN,NaN,NaN,1.0
6,NaN,NaN,NaN,NaN,NaN,1.0
7,NaN,NaN,NaN,NaN,NaN,2.0
8,NaN,NaN,NaN,NaN,NaN,2.0
9,NaN,NaN,NaN,NaN,NaN,0.0
10,NaN,NaN,NaN,NaN,NaN,0.0
11,NaN,NaN,NaN,NaN,NaN,0.0
12,NaN,NaN,NaN,NaN,NaN,0.0
13,NaN,NaN,NaN,NaN,NaN,0.0
14,NaN,NaN,NaN,NaN,NaN,0.0
15,NaN,NaN,NaN,NaN,NaN,2.0
16,NaN,NaN,NaN,NaN,NaN,2.0
17,NaN,NaN,NaN,NaN,NaN,2.0
18,NaN,NaN,NaN,NaN,NaN,2.0
19,NaN,NaN,NaN,NaN,NaN,2.0
20,NaN,NaN,NaN,NaN,NaN,2.0

In [129]:
# How about now?
pd.concat([concat_a_df, concat_c_df], axis=1)

,transaction_id,quarter,customer_name,transit_code,order_total_amt,process_flag
0,3345,Q1,Robert Robertson,X4,100,1
1,3346,Q1,David Davison,Y4,230,1
2,3347,Q1,Jack Froot,X5,332,1
3,3348,Q1,Dolby Sorand,Y5,50,1
4,3349,Q1,Robert Robertson,X6,65,1
5,3350,Q1,David Davison,Y6,80,1
6,3351,Q1,Jack Froot,X7,125,1
7,3352,Q1,Dolby Sorand,Y7,225,2
8,3353,Q1,Robert Robertson,X8,347,2
9,3354,Q1,David Davison,Y8,567,0
10,3355,Q1,Jack Froot,X9,334,0
11,3356,Q1,Dolby Sorand,Y9,543,0
12,3357,Q1,Robert Robertson,X10,100,0
13,3358,Q1,David Davison,Y10,230,0
14,3359,Q1,Jack Froot,X11,332,0
15,3360,Q1,Dolby Sorand,Y11,50,2
16,3361,Q1,Robert Robertson,X12,65,2
17,3362,Q1,David Davison,Y12,80,2
18,3363,Q1,Jack Froot,X13,125,2
19,3364,Q1,Dolby Sorand,Y13,225,2
20,3365,Q1,Robert Robertson,X14,347,2

### Merge - Database Style Joins

In [148]:
tx_df = pd.read_csv('tx_table.tsv', sep='\t')
shipment_df = pd.read_csv('shipment_table.tsv', sep='\t')

In [149]:
tx_df.head()

,transaction_id,quarter,customer_name,transit_code,order_total_amt,process_flag
0,3345,Q1,Robert Robertson,X4,100,1
1,3346,Q1,David Davison,Y4,230,1
2,3347,Q1,Jack Froot,X5,332,1
3,3348,Q1,Dolby Sorand,Y5,50,1
4,3349,Q1,Robert Robertson,X6,65,1

In [150]:
shipment_df.head()

  shipment_id  transaction_id shipment_status
0     xk-9923            3345      in_process
1     xk-9924            3346         shipped
2     xk-9925            3347         shipped
3     xk-9926            3348         delayed
4     xk-9927            3349         shipped

In [151]:
# Let's join the table together!
tx_shipment_df = pd.merge(tx_df, shipment_df, on='transaction_id')
tx_shipment_df

,transaction_id,quarter,customer_name,transit_code,order_total_amt,process_flag,shipment_id,shipment_status
0,3345,Q1,Robert Robertson,X4,100,1,xk-9923,in_process
1,3346,Q1,David Davison,Y4,230,1,xk-9924,shipped
2,3347,Q1,Jack Froot,X5,332,1,xk-9925,shipped
3,3348,Q1,Dolby Sorand,Y5,50,1,xk-9926,delayed
4,3349,Q1,Robert Robertson,X6,65,1,xk-9927,shipped
5,3350,Q1,David Davison,Y6,80,1,xk-9928,shipped
6,3351,Q1,Jack Froot,X7,125,1,xk-9929,in_process
7,3352,Q1,Dolby Sorand,Y7,225,2,xk-9930,shipped
8,3353,Q1,Robert Robertson,X8,347,2,xk-9931,shipped
9,3354,Q1,David Davison,Y8,567,0,xk-9932,shipped
10,3355,Q1,Jack Froot,X9,334,0,xk-9933,delayed
11,3356,Q1,Dolby Sorand,Y9,543,0,xk-9934,shipped
12,3357,Q1,Robert Robertson,X10,100,0,xk-9935,shipped
13,3358,Q1,David Davison,Y10,230,0,xk-9936,shipped
14,3359,Q1,Jack Froot,X11,332,0,xk-9937,shipped
15,3360,Q1,Dolby Sorand,Y11,50,2,xk-9938,delayed
16,3361,Q1,Robert Robertson,X12,65,2,xk-9939,shipped
17,3362,Q1,David Davison,Y12,80,2,xk-9940,shipped
18,3363,Q1,Jack Froot,X13,125,2,xk-9941,shipped
19,3364,Q1,Dolby Sorand,Y13,225,2,xk-9942,in_process
20,3365,Q1,Robert Robertson,X14,347,2,xk-9943,shipped
21,3366,Q2,David Davison,Y14,567,1,xk-9944,in_process
22,3367,Q2,Jack Froot,X15,334,1,xk-9945,shipped
23,3376,Q2,Dolby Sorand,Y19,225,0,xk-9954,shipped
24,3377,Q2,Robert Robertson,X20,347,0,xk-9955,delayed
25,3378,Q2,David Davison,Y20,567,0,xk-9956,shipped
26,3385,Q3,Robert Robertson,X24,65,2,xk-9957,shipped
27,3386,Q3,David Davison,Y24,80,1,xk-9958,shipped
28,3387,Q3,Jack Froot,X25,125,1,xk-9959,shipped
29,3388,Q3,Dolby Sorand,Y25,225,1,xk-9960,shipped
30,3389,Q3,Robert Robertson,X26,347,1,xk-9961,returned
31,3390,Q3,David Davison,Y26,567,1,xk-9962,in_process
32,3391,Q3,Jack Froot,X27,334,1,xk-9963,delayed
33,3392,Q4,Dolby Sorand,Y27,543,1,xk-9964,shipped
34,3393,Q4,Robert Robertson,X28,100,2,xk-9965,shipped
35,3394,Q4,David Davison,Y28,230,2,xk-9966,shipped
36,3395,Q4,Jack Froot,X29,332,0,xk-9967,shipped
37,3396,Q4,Dolby Sorand,Y29,50,0,xk-9968,shipped
38,3397,Q4,Robert Robertson,X30,65,0,xk-9969,shipped
39,3398,Q4,David Davison,Y30,80,0,xk-9970,shipped
40,3399,Q4,Jack Froot,X31,125,0,xk-9971,shipped

In [152]:
# do we have all the data?
print(len(tx_df))
print(len(shipment_df))
print(len(tx_shipment_df))

55
41
41

In [157]:
# Why does this matter? Let's sum up the order totals.
print('Transaction Total:', tx_df.order_total_amt.sum())
print('Transaction Shipment Total:', tx_shipment_df.order_total_amt.sum())

Transaction Total: 12974
Transaction Shipment Total: 9860

In [160]:
# We need to do an outer join
tx_shipment_outer_df = pd.merge(tx_df, shipment_df, on='transaction_id', how='left')
print(len(tx_shipment_outer_df))
print('Transaction Shipment Outer Total:', tx_shipment_outer_df.order_total_amt.sum())

55
Transaction Shipment Outer Total: 12974

In [161]:
tx_shipment_outer_df

,transaction_id,quarter,customer_name,transit_code,order_total_amt,process_flag,shipment_id,shipment_status
0,3345,Q1,Robert Robertson,X4,100,1,xk-9923,in_process
1,3346,Q1,David Davison,Y4,230,1,xk-9924,shipped
2,3347,Q1,Jack Froot,X5,332,1,xk-9925,shipped
3,3348,Q1,Dolby Sorand,Y5,50,1,xk-9926,delayed
4,3349,Q1,Robert Robertson,X6,65,1,xk-9927,shipped
5,3350,Q1,David Davison,Y6,80,1,xk-9928,shipped
6,3351,Q1,Jack Froot,X7,125,1,xk-9929,in_process
7,3352,Q1,Dolby Sorand,Y7,225,2,xk-9930,shipped
8,3353,Q1,Robert Robertson,X8,347,2,xk-9931,shipped
9,3354,Q1,David Davison,Y8,567,0,xk-9932,shipped
10,3355,Q1,Jack Froot,X9,334,0,xk-9933,delayed
11,3356,Q1,Dolby Sorand,Y9,543,0,xk-9934,shipped
12,3357,Q1,Robert Robertson,X10,100,0,xk-9935,shipped
13,3358,Q1,David Davison,Y10,230,0,xk-9936,shipped
14,3359,Q1,Jack Froot,X11,332,0,xk-9937,shipped
15,3360,Q1,Dolby Sorand,Y11,50,2,xk-9938,delayed
16,3361,Q1,Robert Robertson,X12,65,2,xk-9939,shipped
17,3362,Q1,David Davison,Y12,80,2,xk-9940,shipped
18,3363,Q1,Jack Froot,X13,125,2,xk-9941,shipped
19,3364,Q1,Dolby Sorand,Y13,225,2,xk-9942,in_process
20,3365,Q1,Robert Robertson,X14,347,2,xk-9943,shipped
21,3366,Q2,David Davison,Y14,567,1,xk-9944,in_process
22,3367,Q2,Jack Froot,X15,334,1,xk-9945,shipped
23,3368,Q2,Dolby Sorand,Y15,543,1,NaN,NaN
24,3369,Q2,Robert Robertson,X16,100,1,NaN,NaN
25,3370,Q2,David Davison,Y16,230,1,NaN,NaN
26,3371,Q2,Jack Froot,X17,332,1,NaN,NaN
27,3372,Q2,Dolby Sorand,Y17,50,1,NaN,NaN
28,3373,Q2,Robert Robertson,X18,65,2,NaN,NaN
29,3374,Q2,David Davison,Y18,80,2,NaN,NaN
30,3375,Q2,Jack Froot,X19,125,0,NaN,NaN
31,3376,Q2,Dolby Sorand,Y19,225,0,xk-9954,shipped
32,3377,Q2,Robert Robertson,X20,347,0,xk-9955,delayed
33,3378,Q2,David Davison,Y20,567,0,xk-9956,shipped
34,3379,Q2,Jack Froot,X21,334,0,NaN,NaN
35,3380,Q2,Dolby Sorand,Y21,543,0,NaN,NaN
36,3381,Q2,Robert Robertson,X22,100,2,NaN,NaN
37,3382,Q2,David Davison,Y22,230,2,NaN,NaN
38,3383,Q3,Jack Froot,X23,332,2,NaN,NaN
39,3384,Q3,Dolby Sorand,Y23,50,2,NaN,NaN
40,3385,Q3,Robert Robertson,X24,65,2,xk-9957,shipped
41,3386,Q3,David Davison,Y24,80,1,xk-9958,shipped
42,3387,Q3,Jack Froot,X25,125,1,xk-9959,shipped
43,3388,Q3,Dolby Sorand,Y25,225,1,xk-9960,shipped
44,3389,Q3,Robert Robertson,X26,347,1,xk-9961,returned
45,3390,Q3,David Davison,Y26,567,1,xk-9962,in_process
46,3391,Q3,Jack Froot,X27,334,1,xk-9963,delayed
47,3392,Q4,Dolby Sorand,Y27,543,1,xk-9964,shipped
48,3393,Q4,Robert Robertson,X28,100,2,xk-9965,shipped
49,3394,Q4,David Davison,Y28,230,2,xk-9966,shipped
50,3395,Q4,Jack Froot,X29,332,0,xk-9967,shipped
51,3396,Q4,Dolby Sorand,Y29,50,0,xk-9968,shipped
52,3397,Q4,Robert Robertson,X30,65,0,xk-9969,shipped
53,3398,Q4,David Davison,Y30,80,0,xk-9970,shipped
54,3399,Q4,Jack Froot,X31,125,0,xk-9971,shipped

## Excel Lyfe

### Vlookup

In [165]:
vlookup_tx_df = pd.read_excel('vlookup-example_raw.xlsx', sheet_name='transaction')
vlookup_prod_df = pd.read_excel('vlookup-example_raw.xlsx', sheet_name='product_lookup')

In [166]:
vlookup_tx_df

    transaction_id  product_id
0            11234           1
1            11235           4
2            11236           4
3            11237           2
4            11238           3
5            11239           1
6            11240           5
7            11241           1
8            11242           3
9            11243           2
10           11244           2
11           11245           2
12           11246           1
13           11247           1
14           11248           3
15           11249           4
16           11250           5

In [167]:
vlookup_prod_df

   product_id product_name
0           1      Turnips
1           2    Mushrooms
2           3      Bananas
3           4     Cherries
4           5      Peaches

In [168]:
vlookup_df = pd.merge(vlookup_tx_df, vlookup_prod_df, how='inner', on='product_id')

In [169]:
vlookup_df

    transaction_id  product_id product_name
0            11234           1      Turnips
1            11239           1      Turnips
2            11241           1      Turnips
3            11246           1      Turnips
4            11247           1      Turnips
5            11235           4     Cherries
6            11236           4     Cherries
7            11249           4     Cherries
8            11237           2    Mushrooms
9            11243           2    Mushrooms
10           11244           2    Mushrooms
11           11245           2    Mushrooms
12           11238           3      Bananas
13           11242           3      Bananas
14           11248           3      Bananas
15           11240           5      Peaches
16           11250           5      Peaches

### Pivot Tables

In [172]:
tx_df.head()

,transaction_id,quarter,customer_name,transit_code,order_total_amt,process_flag
0,3345,Q1,Robert Robertson,X4,100,1
1,3346,Q1,David Davison,Y4,230,1
2,3347,Q1,Jack Froot,X5,332,1
3,3348,Q1,Dolby Sorand,Y5,50,1
4,3349,Q1,Robert Robertson,X6,65,1

In [178]:
pd.pivot_table(tx_df, values='order_total_amt', index=['quarter'], columns=['customer_name'], aggfunc=np.sum)

customer_name  David Davison  Dolby Sorand  Jack Froot  Robert Robertson
quarter
Q1                      1187          1093        1248              1024
Q2                      1674          1361        1125               612
Q3                       647           275         791               412
Q4                       310           593         457               165

In [179]:
pd.pivot_table(tx_df, values='order_total_amt', index=['quarter', 'customer_name'], aggfunc=np.sum)

                          order_total_amt
quarter customer_name
Q1      David Davison                1187
        Dolby Sorand                 1093
        Jack Froot                   1248
        Robert Robertson             1024
Q2      David Davison                1674
        Dolby Sorand                 1361
        Jack Froot                   1125
        Robert Robertson              612
Q3      David Davison                 647
        Dolby Sorand                  275
        Jack Froot                    791
        Robert Robertson              412
Q4      David Davison                 310
        Dolby Sorand                  593
        Jack Froot                    457
        Robert Robertson              165